In [10]:
# !conda install mysql-connector-python

In [4]:
# connecting the mysql check
import mysql.connector
#importing database
database = mysql.connector.connect(host="localhost",user="root",password="")#for commit()
db = database.cursor()#currrnt database

In [6]:
# creating the database
try:
    sql="CREATE DATABASE pythons"
    db.execute(sql)# execute run query or my sqlcode or query
except:
    print('already exits')

already exits

In [8]:
# to connect the database there required only database name for connect the server
#connecting the pythons database by database field = pythons 
database = mysql.connector.connect(host="localhost",user="root",password="",database = "pythons")#database store the value given data
db = database.cursor()#store for delete update and insert
# sql="CREATE TABlE subject(id INT,name VARCHAR(255))"
# db.execute(sql)

In [10]:
# this code is written by mysql
try:
    sql= '''CREATE TABLE student(
    `sn` int(11) NOT NULL,
    `name` varchar(200) COLLATE utf8_unicode_ci NOT NULL,
    `physics` float NOT NULL DEFAULT 0,
    `chemistry` float NOT NULL DEFAULT 0,
    `math` float NOT NULL DEFAULT 0,
    `english` float NOT NULL DEFAULT 0,
    `nepali` float NOT NULL DEFAULT 0,
    `total` float NOT NULL DEFAULT 0,
    `percentage` float NOT NULL DEFAULT 0,
    `grade` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT 'F'
    )'''
    db.execute(sql)
except:
    print('already created')

already created

In [26]:
# insert data
#mannul
database = mysql.connector.connect(host="localhost",user="root",password="",database = "pythons")#database store the value given data
db = database.cursor()
# sql='''INSERT INTO student (name, physics, chemistry, math, english, nepali,total, percentage, grade) VALUES
# ('hari', 98, 99, 87, 88, 77, 400, 97.6, 'A+')'''
# db.execute(sql)
# database.commit()#for commit

In [29]:
n=int(input('add number='))
for i in range(n):
    name=(input('enter name :'))
    physics=int(input('enter physic mark :'))
    chemistry=int(input('enter chemistry mark :'))
    nepali=int(input('enter nepali mark :'))
    english=int(input('enter english mark :'))
    math=int(input('enter mathematics mark :'))
    totalMark=physics+chemistry+nepali+english+math
    per=totalMark/5
    if per>=80:
        grade='A'
    elif per>=60:
        grade='B'
    elif per>=50:
        grade='C' 
    else:
        grade='f' 
    sql=f'''INSERT INTO student (name, physics, chemistry, math, english, nepali,total, percentage, grade) VALUES
    ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {totalMark}, {per}, '{grade}')'''
    db.execute(sql)

database.commit()

DataError: 1136 (21S01): Column count doesn't match value count at row 1

In [28]:
sql='''SELECT * FROM student'''#if read then select the query
db.execute(sql)
db.fetchall()#reading

[(0, 'bbb', 55.0, 66.0, 77.0, 666.0, 77.0, 941.0, 188.2, 'A'),
 (0, '66', 66.0, 66.0, 665.0, 66.0, 66.0, 929.0, 185.8, 'A'),
 (0, 'rrrr', 44.0, 555.0, 66.0, 655.0, 66.0, 1386.0, 277.2, 'A')]

In [24]:
sql="SELECT * FROM student WHERE grade ='A' "
db.execute(sql)
db.fetchall()

[(0, 'bbb', 55.0, 66.0, 77.0, 666.0, 77.0, 941.0, 188.2, 'A'),
 (0, '66', 66.0, 66.0, 665.0, 66.0, 66.0, 929.0, 185.8, 'A')]

In [23]:
sql="DELETE FROM student WHERE sn = 1"
db.execute(sql)
database.commit()

In [14]:
sql="UPDATE student SET name='rama' WHERE name='hari'"
db.execute(sql)
database.commit()

In [ ]:
# 1.open xampp control panel
# 2.connect the database by database_name field or create database
# 3.create table in the database or mannually
# 4.insert,update,delete

In [ ]:
# today question
# cursor()
# database.commit()